import React from "react";
import { Link } from "react-router-dom";
import "./Biography.css";

function Biography() {
    return (
        <div className="biography">
            <header className="bio-header">
                <h1>Շառլ Կուլոն</h1>
                <img
                    src="/images/coulomb.jpg"
                    alt="Շառլ Կուլոն"
                    className="bio-photo"
                />
            </header>
            <div className="bio-content">
                <p>
                    Ֆրանսիացի ֆիզիկոս Շառլ Կուլոնը ծնվել է 1736թ. հունիսի 14-ին: Նա իր գիտական գործունեությունը սկսել է տարբեր նյութերի ոլորման ֆիզիկական երևույթի ուսումնասիրությամբ. 1769թ. նա հետազոտել է մազերի, 1777թ.՝ մետաքսաթելերի, 1784թ.՝ մետաղալարերի ոլորումը և ձևակերպել այդ երևույթի օրենքները:
                    Իր հետագա ուսումնասիրությունների համար Կուլոնը ստեղծել է ոլորակշեռքը, որը կիրառել է կետային էլեկտրական լիցքերի և մագնիսական բևեռների փոխազդեցությունն ուսումնասիրելու նպատակով: Այս ուսումնասիրությունները 1785թ. հանգեցրին էլեկտրաստատիկայի հիմնական օրենքի սահմանմանը, որը հետագայում կոչվեց Կուլոնի օրենք:
                    Այս օրենքն արտահայտում է 2 անշարժ կետային լիցքերի փոխազդեցության ուժի կախումը նրանց մեծությունից և հեռավորությունից: Կուլոնը ցույց է տվել նաև, որ էլեկտրական լիցքերը բաշխվում են հաղորդչի մակերևույթին, ներմուծել է մագնիսական մոմենտի և լիցքերի բևեռացման հասկացությունը: Կուլոնը Փարիզի գիտությունների ակադեմիայի անդամ էր: Նրա  անունով է կոչվել էլեկտրականության քանակի միավորը:
                    Միավորների միջազգային համակարգում 1 Կ-ը էլեկտրականության այն քանակն է, որն անցնում է հաղորդչի լայնական հատույթով 1 վայրկյանում 1Ա անփոփոխ հոսանքի դեպքում:
                </p>
            </div>
            <div className="bio-contentt">
                <h1 className="banadzev">Կուլոնի օրենք</h1>
                <p>Դեռ հին ժամանակներից հայտնի էր, որ մի մարմինը մյուսով շփելիս, օրինակ՝ սաթը բրդով կամ ապակին մետաքսով, նրանք ձեռք են բերում այլ մարմիններ դեպի իրենց ձգելու հատկության: </p>
                <p>Ակնհայտորեն երևում է նաև, որ ձգողության այդ ուժը բազմաթիվ անգամ գերազանցում է նույն մարմինների գրավիտացիոն փոխազդեցության ուժը: Այս նոր փոխազդեցությանն անվանում են էլեկտրական (հուներեն «էլեկտրոն» բառը նշանակում է սաթ), փոխազդող մարմիններին՝ էլեկտրականացած, իսկ պրոցեսը՝ էլեկտրականացում:</p>
              <p>Մարմինների էլեկտրական փոխազդեցությունը քանակապես բնութագրող ֆիզիկական մեծությունը կոչվում է էլեկտրական լիցք և նշանակվում 𝑞 տառով:</p>
              <p>ՄՀ-ում էլեկտրական լիցքի միավորը Կուլոնն է (1 Կլ)՝ ի պատիվ Շառլ Կուլոնի (1736−1806 թթ.), ով ձևակերպել է էլեկտրական լիցքերի փոխազդեցության օրենքը:</p>
              <p>Ինչպես ցույց տվեցին փորձերը, բրդով շփված 2 սաթե կամ մետաքսով շփված 2 ապակե միատեսակ ձողերը իրար վանում են, իսկ ապակե և սաթե ձողերը՝ իրար ձգում:</p>
              <p>Նշանակում է գոյություն ունի երկու տեսակի էլեկտրական լիցք: Ամերիկացի ֆիզիկոս Բենջամին Ֆրանկլինի առաջարկով մետաքսով շփված ապակու վրա առաջացած լիցքն անվանեցին դրական և վերագրեցին «+» նշան, իսկ բրդով շփված սաթի վրա առաջացած լիցքին՝ բացասական և վերագրեցին «−» նշան: Այս նշանակումից հետո կարելի է սահմանել լիցքավորված մարմինների փոխազդեցության կանոնը:  </p>
              <p>Նույն նշանի (կամ նույնանուն) լիցքեր ունեցող մարմինները փոխադարձաբար վանում են, իսկ հակառակ նշանի (կամ տարանուն) լիցքեր ունեցող մարմինները փոխադարձաբար ձգում են միմյանց:</p>
              <p>Էլեկտրական փոխազդեցության ուժի գոյությունը պայմնավորված է մարմինների վրա ստատիկ լիցքերի առկայությամբ, այդ ուժի ուղղությանը՝ լիցքերի նշանով: Փորձը ցույց է տալիս, որ լիցքավորված մարմինների փոխազդեցության ուժի մեծությունը  ախված է նրանց լիցքերի մեծություններից և լիցքավորված մարմինների միջև եղած հեռավորությունից:</p>
             <p>Երկու անշարժ, կետային (փոքր չափեր ունեցող) լիցքերի փոխազդեցության ուժի մեծությունը ուղիղ համեմատական է լիցքերի մոդուլների արտադրյալին և հակադարձ համեմատական է դրանց հեռավորության քառակուսուն:</p>
             <h1 className="banadzev">
  <b>F= k(𝑞1*𝑞2 / 𝑅²)</b>
</h1>
              <p>որտեղ 𝑞1-ը և 𝑞2-ը փոխազդող մարմինների էլեկտրական լիցքերի մեծություններն են, 𝑅-ը՝ նրանց միջև եղած հեռավորությունը: 𝑘-ն համեմատականության գործակից է, հաստատուն մեծություն, որը հավասար է <b>k = 9 × 10⁹ Ն⋅մ² / Կլ²</b> Փորձնական ճանապարհով ստացված այս օրենքը կոչվում է Կուլոնի օրենք:</p>
                <div class="container">
                    <Link to="/quiz" className="quiz-link">
                     անցնել թեստին →
                    </Link>
                </div>

            </div>


        </div>
    )
}

export default Biography;

